"""Дано предложение. Удалить из него все буквы 'с'."""

word = str(input('Введите предложение: '))

print(word.replace('c', ''))